{
  "test": "eng test",
  "co-table": "Table",
  "co-card": "Card",
  "co-view": "View",
  "ac-name": "Account name",
  "co-bal": "Balance",
  "co-cur": "Currency",
  "co-actions": "Actions",
  "co-color": "Color",
  "co-exp-csv": "Export to CSV",
  "co-no-opts": "No options",
  "co-step": "From 0 to Infinity",
  "co-create": "Create",
  "co-back": "Back",
  "co-las-up": "Last update",
  "co-cre-at": "Created at",
  "co-upd-at": "Updated at",
  "co-upd": "Update",
  "co-date": "Date",
  "co-dest": "Destination",
  "co-edi": "Edit",
  "co-save": "Save",
  "co-cancel": "Cancel",
  "co-delete": "Delete",
  "co-quick-act": "Quick actions",
  "co-icon": "Icon",
  "co-all": "All",
  "co-loc": "Location",
  "co-no-loc": "No location set",
  "co-profile": "Profile",
  "co-latest-log": "The latest logins",
  "co-tot-txn": "Total transactions",
  "co-field-inv": "Field is invalid",

  "co-apply": "Apply",
  "co-clear-all": "Clear all",
  "co-inc": "Income",
  "co-exp": "Expense",
  "co-tra": "Transfer",
  "co-incs": "Incomes",
  "co-exps": "Expenses",
  "co-tras": "Transfers",
  "co-filters": "Filters",
  "co-amo": "Amount",
  "co-desc": "Description",
  "co-no-desc": "No description",
  "co-undone": " Are you sure you want to delete this? Please enter the bolded text inside squared brackets to confirm deletion: {name}",
  "co-undone2": "This action cannot be undone.",
  "co-conf-text": "Confirmation field",
  "co-del-suc": "The selected item has been successfully removed.",
  "co-del-err": "Unable to remove the item from the system. Please check your connection and try again.",
  "co-txn-time": "All-time transactions",
  "co-txn-month": "Transactions for {month}",
  "co-txn-months": "Transactions from {start} to {end}",
  "co-dsh-time": "All-time analytics",
  "co-dsh-month": "Analytics for {month}",
  "co-dsh-months": "Analytics from {start} to {end}",

  "co-comp-prev-month": "Compared to previous month",
  "co-geo-err": "Geolocation is disabled or not allowed by your browser",
  "co-usr": "Username",
  "co-usr-req": "Username is required",
  "co-passw": "Password",
  "co-passw-req": "Password is required",

  "auth-sign-in": "Sign in",
  "auth-sign-up": "Sign up",
  "auth-home": "Go home",
  "auth-remem": "Remember me",
  "auth-forgot": "Forgot password?",
  "auth-welcome": "Welcome!",
  "auth-welcome-back": "Welcome back!",
  "auth-no-yet": "Do not have an account yet? {create}",

  "auth-name": "Name",
  "auth-name-req": "Name is required",
  "auth-email": "Email",
  "auth-email-req": "Email is required",
  "auth-phone": "Phone",
  "auth-phone-req": "Phone is required",
  "auth-up-succ-tit": "Registration Successful",
  "auth-up-succ-mes": "Thank you for registering with us. You can now login to your account and start using our services.",
  "auth-up-fail-tit": "We're sorry, but your registration was unsuccessful",
  "auth-up-fail-mes": "Please double-check your data and try again. If you continue to experience issues, please contact our support team for assistance.",
  "auth-in-fail-tit": "We're sorry, but your login was unsuccessful",
  "auth-in-fail-mes": "Please double-check your credentials and try again. If you continue to experience issues, please contact our support team for assistance.",

  "acc": "Accounts",
  "acc-to": "To account",
  "acc-from": "From account",
  "acc-create": "Create an account",
  "acc-update": "Edit account",
  "acc-info": "Accounts represent a user's financial entity, such as a bank account, credit card, or investment account. You can add, edit, and delete accounts in the app to track their balances and transactions.",
  "acc-f-title": "Delivery creation failed",
  "acc-f-desc": "There was an error creating the delivery. Please try again later. If the problem persists, please contact customer support.",
  "acc-fu-title": "Account saving failed",
  "acc-fu-desc": "There was an error saving the account. Please try again later. If the problem persists, please contact customer support.",
  "acc-det-info": "The page displays all the important information about your account including the account name, balance, currency, and transaction history. You can view your transactions, filter them by month, search for specific transactions, and create new transactions. Use this page to get a detailed overview of your account and manage your transactions effectively.",
  "acc-del": "Delete Account",
  "no-acc-found": "No accounts found",
  "no-acc-yet": "You haven't added any accounts yet. To get started: ",
  "no-acc-1": "Click the \"Create an account\" button below.",
  "no-acc-2": "Choose the type of account you want to add (e.g. checking, savings, credit card).  ",
  "no-acc-3": "Enter the account details, including the name, currency, and initial balance.  ",
  "no-acc-4": "Click \"Save\" to create the account.",
  "acc-c-name": "The name of the account, e.g. 'Checking', 'Savings', 'Credit Card', etc.",
  "acc-c-cur": "The currency associated with the account, e.g. USD, EUR, GBP, etc",
  "acc-c-color": "The color associated with the account. This can be used for easy identification and organization of accounts",
  "acc-c-icon": "An icon that represents the account. This can also be used for easy identification and organization of transactions.",
  "acc-c-bal": "The start balance of the account. This field is computed based on the transactions associated with the account, and is not directly editable by the user.",

  "txn": "Transactions",
  "txn-info": "Transactions are a core feature of our app that allows you to easily keep track of your expenses, incomes, and transfers. With just a few clicks, you can create a new transaction, specifying the date, amount, description, and other important details. You can also assign categories and tags to your transactions to help you better organize and analyze your spending. Plus, our intuitive interface allows you to quickly view all of your transactions, filter by date or category, and easily edit or delete any transaction as needed. With our Transactions feature, you'll always be in control of your finances, giving you greater peace of mind and helping you achieve your financial goals.",
  "txn-det-info": "The page provides a comprehensive view of a specific transaction, including its date, amount, category, and any associated tags. You can also view the location of the transaction and any notes or descriptions that were added. This page also allows you to edit or delete the transaction, as well as view related transactions and account balances. With this information at your fingertips, you can easily keep track of your finances and make informed decisions about your spending habits.",
  "no-txn-found": "No transactions yet!",
  "no-txn-found-for": "No transactions yet for {range}",
  "no-txn-desc": "You can add a new transaction by clicking the button below.",
  "txn-create": "Add a transaction",
  "txn-update": "Edit transaction",
  "txn-add-t": "Add a new transaction",
  "txn-del": "Delete transaction",
  "txn-conf-del": "Delete transaction {id}",
  "txn-c-from": "Select the account from which the money is being taken for this transaction.",
  "txn-c-to": "Select the account to which the money is being added for this transaction.",
  "txn-c-date": "Enter the date on which the transaction occurred.",
  "txn-c-amount": "Enter the amount of money involved in the transaction.",
  "txn-c-desc": "Enter a brief description of the transaction, such as 'Grocery shopping' or 'Dinner with friends'.",
  "txn-c-cat": "Select a category that best describes the transaction.",
  "txn-c-tag": "Select any relevant tags to further describe the transaction.",
  "txn-c-type": "Select the type of transaction.",
  "txn-count": "{count} transactions recorded on {date}",

  "txn-c-loc": "Enter the location where the transaction occurred, such as a store or restaurant. This field is optional.",
  "txn-hide": "Hide transactions",
  "txn-show": "Show transactions",
  "txn-search": "Search transactions",
  "txn-type": "Transaction type",

  "cat-categ": "Categories",
  "cat-cat": "Category",
  "cat-info": "Categories are a way for users to group their transactions based on their purpose or type. For example, a user may create categories such as 'Food & Dining', 'Transportation', 'Entertainment', etc. Categories can have a name, color, and icon for easy identification and organization. Users can assign categories to their transactions to keep track of their spending in different areas and gain insights into their financial habits.",
  "cat-no-found": "No categories yet!",
  "cat-no-desc": "You can add a new category by clicking the button below.",
  "cat-create": "Create a category",
  "cat-del": "Delete category",
  "cat-name": "Category name",
  "cat-f-title": "Category creation failed",
  "cat-f-desc": "There was an error creating the category. Please try again later. If the problem persists, please contact customer support.",
  "cat-fu-title": "Category saving failed",
  "cat-fu-desc": "There was an error saving the category. Please try again later. If the problem persists, please contact customer support.",
  "cat-c-name": "The name of the category, e.g. 'Food & Dining', 'Transportation', 'Entertainment', etc.",
  "cat-c-icon": "An icon that represents the category. This can also be used for easy identification and organization of transactions.",
  "cat-c-color": "The color associated with the category. This can be used for easy identification and organization of transactions.",
  "cat-update": "Edit category",
  "cat-all": "All categories",

  "tag-tag": "Tags",
  "tag-info": "Tags are another way for users to organize their transactions, but they offer more flexibility than categories. Users can create tags based on any criteria they choose, such as the merchant name, the location, or the type of payment used. Tags can also have a name and color for easy identification. Users can assign multiple tags to a single transaction, allowing them to track their spending in more detail and analyze their financial behavior in different ways.",
  "tag-c-name": "The name of the tag, e.g. 'KFC', 'Gas', 'Movies', etc.",
  "tag-c-icon": "The color associated with the tag. This can be used for easy identification and organization of transactions",
  "tag-c-color": "An icon that represents the tag. This can also be used for easy identification and organization of transactions.",
  "tag-no-found": "No tags yet!",
  "tag-no-desc": "You can add a new tag by clicking the button below.",
  "tag-create": "Create a tag",
  "tag-name": "Tag name",
  "tag-del": "Delete tag",
  "tag-f-title": "Tag creation failed",
  "tag-f-desc": "There was an error creating the tag. Please try again later. If the problem persists, please contact customer support.",
  "tag-fu-title": "Tag saving failed",
  "tag-fu-desc": "There was an error saving the tag. Please try again later. If the problem persists, please contact customer support.",
  "tag-update": "Edit tag",

  "dsh-greeting-1": "Welcome back, {name}! Explore your latest transactions and manage your finances with ease.",
  "dsh-greeting-2": "Welcome back, {name}! Here's a summary of your financial information.",
  "dsh-greeting-3": "Welcome back, {name}! Your financial journey starts here.",
  "dsh-greeting-4": "Good to see you again, {name}! Let's stay on top of your finances.",
  "dsh-greeting-5": "Hello {name}! Ready to take control of your money?",
  "dsh-greeting-6": "Hi, {name}! Let's start managing your finances together.",
  "dsh-greeting-7": "Nice to see you, {name}! Let's make some smart financial decisions.",
  "dsh-greeting-8": "Hey {name}, it's great to have you back! Let's get your finances in order.",
  "dsh-greeting-9": "Welcome back, {name}! How can we help you today?",
  "dsh-greeting-10": "Hi {name}! Your financial health is our top priority.",
  "dsh-greeting-11": "Good day, {name}! Let's work together to achieve your financial goals.",
  "dsh-greeting-12": "Greetings, {name}! Time to take your finances to the next level.",
  "dsh-greeting-13": "Good to see you back, {name}! Let's manage your money together.",
  "dsh-greeting-14": "Welcome, {name}, to your financial dashboard. What do you want to achieve today?",
  "dsh-greeting-15": "Hey {name}! Ready to take control of your finances?",
  "dsh-greeting-16": "Nice to see you again, {name}! Let's see how your finances are doing.",
  "dsh-greeting-17": "Welcome back, {name}! How can we help you stay on top of your finances?",
  "dsh-greeting-18": "Glad you're here, {name}! Let's make some progress on your financial goals.",
  "dsh-greeting-19": "Hello again, {name}! Are you ready to make some smart financial decisions?",
  "dsh-greeting-20": "Welcome back, {name}, to your financial dashboard! What's on your mind today?",
  "dsh-greeting-21": "Hey there, {name}! Let's start the day off right by reviewing your finances.",
  "dsh-greeting-22": "Good to have you back, {name}! Let's see how much progress you've made.",

  "dsh-top-txn": "Top transactions",
  "dsh-filter": "Refine Your Search",
  "dsh-month-help": "Select a month to narrow down your transaction history. If no month is selected, analytics from all time will be displayed.",
  "dsh-activity": "Transaction Activity Overview for {year}",
  "dsh-activity-help": "Discover your transactions for this day by clicking on it!"
}
